Tekla.Structures.ModelInternal.dotRebarSpacing_t
Serialization structure for RebarSpacing.

Tekla.Structures.ModelInternal.dotRebarSpacing_t.FirstSpacingZone
The index of the first spacing zone

Tekla.Structures.ModelInternal.dotRebarSpacing_t.NumberSpacingZones
The number of spacing zones.

Tekla.Structures.ModelInternal.dotRebarSpacing_t.StartOffset
The start offset.

Tekla.Structures.ModelInternal.dotRebarSpacing_t.EndOffset
The end offset.

Tekla.Structures.ModelInternal.dotRebarSpacing_t.StartOffsetIsFixed
Indicates whether the start offset is fixed.

Tekla.Structures.ModelInternal.dotRebarSpacing_t.EndOffsetIsFixed
Indicates whether the end offset is fixed.

Tekla.Structures.ModelInternal.dotRebarSpacing_t.StartOffsetIsAutomatic
Indicates whether the start offset is automatic.

Tekla.Structures.ModelInternal.dotRebarSpacing_t.EndOffsetIsAutomatic
Indicates whether the end offset is automatic.

Tekla.Structures.ModelInternal.dotRebarSpacing_t.InheritFromPrimary
Indicates whether the guideline has inherited spacings from the primary guideline.